---
kind: other
id: Properties.T:Autodesk.Revit.DB.DefinitionFile
source: html/eb7ff135-0693-50af-0d45-3f1dbc8f9536.htm
---
# DefinitionFile Properties

This property returns the physical filename of the shared parameters file on disk.